---
layout: single
title: "첫 포스팅 입니다!"
categories: 
  - coding
tag:
  - python
---

# 꼬리 문자열
## 문제 설명 : 문자열들이 담긴 리스트가 주어졌을 때, 모든 문자열들을 순서대로 합친 문자열을 꼬리 문자열이라고 합니다. 꼬리 문자열을 만들 때 특정 문자열을 포함한 문자열은 제외시키려고 합니다. 예를 들어 문자열 리스트 ["abc", "def", "ghi"]가 있고 문자열 "ef"를 포함한 문자열은 제외하고 꼬리 문자열을 만들면 "abcghi"가 됩니다.  
문자열 리스트 str_list와 제외하려는 문자열 ex가 주어질 때, str_list에서 ex를 포함한 문자열을 제외하고 만든 꼬리 문자열을 return하도록 solution 함수를 완성해주세요.

## 입출력 예
str_list |	ex | result
-------------------------------------
["abc", "def", "ghi"] |	"ef" |	"abcghi"
-------------------------------------------
["abc", "bbc", "cbc"] |	"c"	| ""
--------------------------------------------

'''python
def solution(str_list, ex):
    answer = ''
    
    for i in str_list:
        if ex not in i:
            answer += i
        
    return answer
'''

같은 코드를 실행 하였는데 처음에는 실행 실패를 하였고, 
다른 코드로 작성해 실행 후 통과 되었지만 다시 실행했을 때 실패했습니다.   
다시 처음 코드로 실행하니 성공하였는데  
실행할 때마다 결과가 달라지는 이유를 모르겠습니다
